OdGePoint3d.project(OdGePlane!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Projects this point onto the specified plane along the specified vector.
\param plane [in]  Plane on which this point is to be projected
\param vect [in]  Vector defining the projection direction.